---
kind: property
id: P:Autodesk.Revit.UI.TemporaryGraphicsCommandData.Index
source: html/fa23b762-79ad-029b-e438-6193c64cd9a6.htm
---
# Autodesk.Revit.UI.TemporaryGraphicsCommandData.Index Property

The unique index of the temporary graphics object managed by TemporaryGraphicsManager .

## Syntax (C#)
```csharp
public int Index { get; internal set; }
```